TwoMeshAMI/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "cadouter.fms";

maxCellSize 0.0199999;

boundaryCellSize 0.1;

localRefinement
{
    inlet
    {
        cellSize 0.01;
    }
    mrf_outer
    {
        cellSize 0.005;
    }
    outlet
    {
        cellSize 0.01;
    }
    wall
    {
        cellSize 0.01;
    }
}
 
// ************************************************************************* //
