TwoMeshAMI/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    innerCells;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((0.1 0.1 0.2));
    }

    {
        name    rot;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     innerCells;
    }
);


// ************************************************************************* //
